; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	thermograph3 - mode
	spectrograph4 - mode
	infrared2 - mode
	infrared1 - mode
	image0 - mode
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star2 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph4)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph4)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
	(supports instrument6 image0)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
)
(:goal (and
	(pointing satellite1 Star7)
	(pointing satellite3 Phenomenon11)
	(pointing satellite4 Planet10)
	(have_image Star6 thermograph3)
	(have_image Star7 infrared2)
	(have_image Star8 image0)
	(have_image Star9 infrared1)
	(have_image Planet10 thermograph3)
	(have_image Phenomenon11 image0)
	(have_image Planet12 infrared1)
))

)

; plan
1. (turn_to satellite4 planet10 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 planet10)
   goals met: 2 of 10
2. (turn_to satellite3 groundstation5 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 groundstation5)
   goals met: 1 of 10
3. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 10
4. (calibrate satellite3 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 1 of 10
5. (turn_to satellite3 star8 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 star8)
   goals met: 1 of 10
6. (take_image satellite3 star8 instrument5 image0)
   added: (have_image star8 image0)
   goals met: 2 of 10
7. (turn_to satellite3 star7 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star7)
   goals met: 2 of 10
8. (turn_to satellite1 groundstation3 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 10
9. (take_image satellite3 star7 instrument5 infrared2)
   added: (have_image star7 infrared2)
   goals met: 3 of 10
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 10
11. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 3 of 10
12. (turn_to satellite1 planet10 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet10)
   goals met: 3 of 10
13. (take_image satellite1 planet10 instrument1 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 4 of 10
14. (turn_to satellite1 planet12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet12)
   goals met: 4 of 10
15. (take_image satellite1 planet12 instrument1 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 5 of 10
16. (turn_to satellite1 star6 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star6)
   goals met: 5 of 10
17. (take_image satellite1 star6 instrument1 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 6 of 10
18. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 6 of 10
19. (take_image satellite1 star9 instrument1 infrared1)
   added: (have_image star9 infrared1)
   goals met: 7 of 10
20. (turn_to satellite1 star7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star7)
   goals met: 8 of 10
21. (turn_to satellite3 phenomenon11 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon11)
   goals met: 9 of 10
22. (take_image satellite3 phenomenon11 instrument5 image0)
   added: (have_image phenomenon11 image0)
   goals met: 10 of 10
